/**
 * Реализовать программу со следующим функционалом:
 * 1.  Возможность ввода команд из консоли
 * 2.  Возможность считывания информации из файла (путь к файлу задается параметром команды)  и построения на основе
 * этой информации коллекции объектов. Пример команды –  parse input.txt
 * 3.  Возможность сериализовать объекты из коллекции в выходной файл. Пример команды – serialize output.data
 * 4.  Возможность десериализовать объекты из файла и вывести их на печать в консоль. Пример команды – deserialize output.data
 */
package ru.innopolis.uni.course3.exceptions.Lab1;